#include "Tetrahedron.h"

Tetrahedron::Tetrahedron()
{
}

void Tetrahedron::Init()
{
	float VAO[] = {
		// 면 1 (빨간색)
		 0.5f,  0.5f,  0.5f,   1.0f, 0.0f, 0.0f,  // 정점 0
		-0.5f, -0.5f,  0.5f,   1.0f, 0.0f, 0.0f,  // 정점 1
		 0.5f, -0.5f, -0.5f,   1.0f, 0.0f, 0.0f,  // 정점 2
		 // 면 2 (초록색)
		 0.5f,  0.5f,  0.5f,   0.0f, 1.0f, 0.0f,  // 정점 0
		 0.5f, -0.5f, -0.5f,   0.0f, 1.0f, 0.0f,  // 정점 2
		-0.5f,  0.5f, -0.5f,   0.0f, 1.0f, 0.0f,  // 정점 3
		 // 면 3 (파란색)
		 0.5f,  0.5f,  0.5f,   0.0f, 1.0f, 1.0f,  // 정점 0
		-0.5f,  0.5f, -0.5f,   0.0f, 1.0f, 1.0f,  // 정점 3
		-0.5f, -0.5f,  0.5f,   0.0f, 1.0f, 1.0f,  // 정점 1
		 // 면 4 (노란색)
		-0.5f, -0.5f,  0.5f,   1.0f, 1.0f, 0.0f,  // 정점 1
		-0.5f,  0.5f, -0.5f,   1.0f, 1.0f, 0.0f,  // 정점 3
		 0.5f, -0.5f, -0.5f,   1.0f, 1.0f, 0.0f   // 정점 2
	};

	unsigned int VBO[] = {
		0, 1, 2,
		3, 4, 5,
		6, 7, 8,
		9, 10, 11
	};

	shapeVertex = new Vertex(VAO, 12, VBO, 12);
}
